content/essays/34-31-Marjah-2010.org
#+TITLE: Marjah 2010
#+DATE: 2010-01-01
#+HUGO_BASE_DIR: ../../
#+HUGO_SECTION: essays
#+HUGO_TAGS: Civilians
#+EXPORT_FILE_NAME: 34-31-Marjah-2010.org
#+LOCATION: Afghanistan
#+YEAR: 2010


During Operation Moshtarak, U.S. Marines launched a major offensive in Marjah, involving heavy aerial bombardment to retake the town from Taliban control.

Amina Baloch, a mother of five, was preparing dinner when her neighbor’s house was flattened by a precision-guided missile. Her 12-year-old son was wounded by shrapnel.

She spent three nights in a trench with her children before they were evacuated by Red Crescent volunteers. The U.S. claimed success in routing insurgents, but many residents like Amina returned to find their homes in ruins.

**Source:** [[https://www.npr.org/templates/story/story.php?storyId=124633206][NPR]]
